docs/evidence/load-runs/failure10-dev-001/k6.txt
$ kubectl -n online-shop-dev logs job/online-shop-load-failure-10

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/failure.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 101 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m01.0s/5m0s

running (0m02.0s), 20/20 VUs, 163 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m02.0s/5m0s

running (0m03.0s), 20/20 VUs, 268 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m03.0s/5m0s

running (0m04.0s), 20/20 VUs, 383 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m04.0s/5m0s

running (0m05.0s), 20/20 VUs, 497 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m05.0s/5m0s

running (0m06.0s), 20/20 VUs, 650 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m06.0s/5m0s

running (0m07.0s), 20/20 VUs, 806 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m07.0s/5m0s

running (0m08.0s), 20/20 VUs, 945 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m08.0s/5m0s

running (0m09.0s), 20/20 VUs, 1090 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m09.0s/5m0s

running (0m10.0s), 20/20 VUs, 1229 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m10.0s/5m0s

running (0m11.0s), 20/20 VUs, 1347 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m11.0s/5m0s

running (0m12.0s), 20/20 VUs, 1516 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m12.0s/5m0s

running (0m13.0s), 20/20 VUs, 1617 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m13.0s/5m0s

running (0m14.0s), 20/20 VUs, 1713 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m14.0s/5m0s

running (0m15.0s), 20/20 VUs, 1780 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m15.0s/5m0s

running (0m16.0s), 20/20 VUs, 1861 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m16.0s/5m0s

running (0m17.0s), 20/20 VUs, 1978 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m17.0s/5m0s

running (0m18.0s), 20/20 VUs, 2138 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m18.0s/5m0s

running (0m19.0s), 20/20 VUs, 2242 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m19.0s/5m0s

running (0m20.0s), 20/20 VUs, 2314 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m20.0s/5m0s

running (0m21.0s), 20/20 VUs, 2377 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m21.0s/5m0s

running (0m22.0s), 20/20 VUs, 2452 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m22.0s/5m0s

running (0m23.0s), 20/20 VUs, 2529 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m23.0s/5m0s

running (0m24.0s), 20/20 VUs, 2604 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m24.0s/5m0s

running (0m25.0s), 20/20 VUs, 2692 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m25.0s/5m0s

running (0m26.0s), 20/20 VUs, 2752 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m26.0s/5m0s

running (0m27.0s), 20/20 VUs, 2816 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m27.0s/5m0s

running (0m28.0s), 20/20 VUs, 2891 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m28.0s/5m0s

running (0m29.0s), 20/20 VUs, 2961 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m29.0s/5m0s

running (0m30.0s), 20/20 VUs, 2987 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m30.0s/5m0s

running (0m31.0s), 20/20 VUs, 3019 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m31.0s/5m0s

running (0m32.0s), 20/20 VUs, 3152 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m32.0s/5m0s

running (0m33.0s), 20/20 VUs, 3314 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m33.0s/5m0s

running (0m34.0s), 20/20 VUs, 3469 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m34.0s/5m0s

running (0m35.0s), 20/20 VUs, 3587 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m35.0s/5m0s

running (0m36.0s), 20/20 VUs, 3740 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m36.0s/5m0s

running (0m37.0s), 20/20 VUs, 3911 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m37.0s/5m0s

running (0m38.0s), 20/20 VUs, 4057 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m38.0s/5m0s

running (0m39.0s), 20/20 VUs, 4190 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m39.0s/5m0s

running (0m40.0s), 20/20 VUs, 4287 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m40.0s/5m0s

running (0m41.0s), 20/20 VUs, 4390 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m41.0s/5m0s

running (0m42.0s), 20/20 VUs, 4524 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m42.0s/5m0s

running (0m43.0s), 20/20 VUs, 4681 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m43.0s/5m0s

running (0m44.0s), 20/20 VUs, 4841 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m44.0s/5m0s

running (0m45.0s), 20/20 VUs, 4996 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m45.0s/5m0s

running (0m46.0s), 20/20 VUs, 5152 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m46.0s/5m0s

running (0m47.0s), 20/20 VUs, 5293 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m47.0s/5m0s

running (0m48.0s), 20/20 VUs, 5445 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m48.0s/5m0s

running (0m49.0s), 20/20 VUs, 5571 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m49.0s/5m0s

running (0m50.0s), 20/20 VUs, 5683 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m50.0s/5m0s

running (0m51.0s), 20/20 VUs, 5764 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m51.0s/5m0s

running (0m52.0s), 20/20 VUs, 5866 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m52.0s/5m0s

running (0m53.0s), 20/20 VUs, 5958 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m53.0s/5m0s

running (0m54.0s), 20/20 VUs, 6047 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m54.0s/5m0s

running (0m55.0s), 20/20 VUs, 6118 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m55.0s/5m0s

running (0m56.0s), 20/20 VUs, 6182 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m56.0s/5m0s

running (0m57.0s), 20/20 VUs, 6320 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m57.0s/5m0s

running (0m58.0s), 20/20 VUs, 6449 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m58.0s/5m0s

running (0m59.0s), 20/20 VUs, 6536 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m59.0s/5m0s

running (1m00.0s), 20/20 VUs, 6637 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  1m00.0s/5m0s

running (1m01.0s), 20/20 VUs, 6739 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  1m01.0s/5m0s

running (1m02.0s), 20/20 VUs, 6862 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  1m02.0s/5m0s

running (1m03.0s), 20/20 VUs, 6988 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  1m03.0s/5m0s

running (1m04.0s), 20/20 VUs, 7098 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  1m04.0s/5m0s

running (1m05.0s), 20/20 VUs, 7191 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  1m05.0s/5m0s

running (1m06.0s), 20/20 VUs, 7291 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  1m06.0s/5m0s

running (1m07.0s), 20/20 VUs, 7438 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  1m07.0s/5m0s

running (1m08.0s), 20/20 VUs, 7615 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  1m08.0s/5m0s

running (1m09.0s), 20/20 VUs, 7754 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  1m09.0s/5m0s

running (1m10.0s), 20/20 VUs, 7863 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  1m10.0s/5m0s

running (1m11.0s), 20/20 VUs, 7999 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  1m11.0s/5m0s

running (1m12.0s), 20/20 VUs, 8184 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  1m12.0s/5m0s

running (1m13.0s), 20/20 VUs, 8306 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  1m13.0s/5m0s

running (1m14.0s), 20/20 VUs, 8411 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  1m14.0s/5m0s

running (1m15.0s), 20/20 VUs, 8519 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  1m15.0s/5m0s

running (1m16.0s), 20/20 VUs, 8677 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  1m16.0s/5m0s

running (1m17.0s), 20/20 VUs, 8846 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  1m17.0s/5m0s

running (1m18.0s), 20/20 VUs, 8993 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  1m18.0s/5m0s

running (1m19.0s), 20/20 VUs, 9146 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  1m19.0s/5m0s

running (1m20.0s), 20/20 VUs, 9246 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  1m20.0s/5m0s

running (1m21.0s), 20/20 VUs, 9344 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  1m21.0s/5m0s

running (1m22.0s), 20/20 VUs, 9448 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  1m22.0s/5m0s

running (1m23.0s), 20/20 VUs, 9604 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  1m23.0s/5m0s

running (1m24.0s), 20/20 VUs, 9741 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  1m24.0s/5m0s

running (1m25.0s), 20/20 VUs, 9857 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  1m25.0s/5m0s

running (1m26.0s), 20/20 VUs, 9920 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  1m26.0s/5m0s

running (1m27.0s), 20/20 VUs, 10084 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  1m27.0s/5m0s

running (1m28.0s), 20/20 VUs, 10270 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  1m28.0s/5m0s

running (1m29.0s), 20/20 VUs, 10411 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  1m29.0s/5m0s

running (1m30.0s), 20/20 VUs, 10589 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  1m30.0s/5m0s

running (1m31.0s), 20/20 VUs, 10748 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  1m31.0s/5m0s

running (1m32.0s), 20/20 VUs, 10928 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  1m32.0s/5m0s

running (1m33.0s), 20/20 VUs, 11111 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  1m33.0s/5m0s

running (1m34.0s), 20/20 VUs, 11283 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  1m34.0s/5m0s

running (1m35.0s), 20/20 VUs, 11455 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  1m35.0s/5m0s

running (1m36.0s), 20/20 VUs, 11626 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  1m36.0s/5m0s

running (1m37.0s), 20/20 VUs, 11812 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  1m37.0s/5m0s

running (1m38.0s), 20/20 VUs, 11995 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  1m38.0s/5m0s

running (1m39.0s), 20/20 VUs, 12172 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  1m39.0s/5m0s

running (1m40.0s), 20/20 VUs, 12355 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  1m40.0s/5m0s

running (1m41.0s), 20/20 VUs, 12522 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  1m41.0s/5m0s

running (1m42.0s), 20/20 VUs, 12669 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  1m42.0s/5m0s

running (1m43.0s), 20/20 VUs, 12816 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  1m43.0s/5m0s

running (1m44.0s), 20/20 VUs, 13004 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  1m44.0s/5m0s

running (1m45.0s), 20/20 VUs, 13162 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  1m45.0s/5m0s

running (1m46.0s), 20/20 VUs, 13306 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  1m46.0s/5m0s

running (1m47.0s), 20/20 VUs, 13479 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  1m47.0s/5m0s

running (1m48.0s), 20/20 VUs, 13641 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  1m48.0s/5m0s

running (1m49.0s), 20/20 VUs, 13792 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  1m49.0s/5m0s

running (1m50.0s), 20/20 VUs, 13885 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  1m50.0s/5m0s

running (1m51.0s), 20/20 VUs, 14031 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  1m51.0s/5m0s

running (1m52.0s), 20/20 VUs, 14204 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  1m52.0s/5m0s

running (1m53.0s), 20/20 VUs, 14373 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  1m53.0s/5m0s

running (1m54.0s), 20/20 VUs, 14500 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  1m54.0s/5m0s

running (1m55.0s), 20/20 VUs, 14604 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  1m55.0s/5m0s

running (1m56.0s), 20/20 VUs, 14698 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  1m56.0s/5m0s

running (1m57.0s), 20/20 VUs, 14785 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  1m57.0s/5m0s

running (1m58.0s), 20/20 VUs, 14960 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  1m58.0s/5m0s

running (1m59.0s), 20/20 VUs, 15137 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  1m59.0s/5m0s

running (2m00.0s), 20/20 VUs, 15292 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  2m00.0s/5m0s

running (2m01.0s), 20/20 VUs, 15409 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  2m01.0s/5m0s

running (2m02.0s), 20/20 VUs, 15582 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  2m02.0s/5m0s

running (2m03.0s), 20/20 VUs, 15732 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  2m03.0s/5m0s

running (2m04.0s), 20/20 VUs, 15875 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  2m04.0s/5m0s

running (2m05.0s), 20/20 VUs, 15998 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  2m05.0s/5m0s

running (2m06.0s), 20/20 VUs, 16156 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  2m06.0s/5m0s

running (2m07.0s), 20/20 VUs, 16339 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  2m07.0s/5m0s

running (2m08.0s), 20/20 VUs, 16480 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  2m08.0s/5m0s

running (2m09.0s), 20/20 VUs, 16624 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  2m09.0s/5m0s

running (2m10.0s), 20/20 VUs, 16785 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  2m10.0s/5m0s

running (2m11.0s), 20/20 VUs, 16930 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  2m11.0s/5m0s

running (2m12.0s), 20/20 VUs, 17054 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  2m12.0s/5m0s

running (2m13.0s), 20/20 VUs, 17176 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  2m13.0s/5m0s

running (2m14.0s), 20/20 VUs, 17290 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  2m14.0s/5m0s

running (2m15.0s), 20/20 VUs, 17373 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  2m15.0s/5m0s

running (2m16.0s), 20/20 VUs, 17477 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  2m16.0s/5m0s

running (2m17.0s), 20/20 VUs, 17635 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  2m17.0s/5m0s

running (2m18.0s), 20/20 VUs, 17813 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  2m18.0s/5m0s

running (2m19.0s), 20/20 VUs, 17978 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  2m19.0s/5m0s

running (2m20.0s), 20/20 VUs, 18126 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  2m20.0s/5m0s

running (2m21.0s), 20/20 VUs, 18214 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  2m21.0s/5m0s

running (2m22.0s), 20/20 VUs, 18392 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  2m22.0s/5m0s

running (2m23.0s), 20/20 VUs, 18549 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  2m23.0s/5m0s

running (2m24.0s), 20/20 VUs, 18663 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  2m24.0s/5m0s

running (2m25.0s), 20/20 VUs, 18743 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  2m25.0s/5m0s

running (2m26.0s), 20/20 VUs, 18813 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  2m26.0s/5m0s

running (2m27.0s), 20/20 VUs, 18840 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  2m27.0s/5m0s

running (2m28.0s), 20/20 VUs, 18927 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  2m28.0s/5m0s

running (2m29.0s), 20/20 VUs, 19062 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  2m29.0s/5m0s

running (2m30.0s), 20/20 VUs, 19191 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  2m30.0s/5m0s

running (2m31.0s), 20/20 VUs, 19304 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  2m31.0s/5m0s

running (2m32.0s), 20/20 VUs, 19401 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  2m32.0s/5m0s

running (2m33.0s), 20/20 VUs, 19530 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  2m33.0s/5m0s

running (2m34.0s), 20/20 VUs, 19642 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  2m34.0s/5m0s

running (2m35.0s), 20/20 VUs, 19770 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  2m35.0s/5m0s

running (2m36.0s), 20/20 VUs, 19897 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  2m36.0s/5m0s

running (2m37.0s), 20/20 VUs, 19983 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  2m37.0s/5m0s

running (2m38.0s), 20/20 VUs, 20129 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  2m38.0s/5m0s

running (2m39.0s), 20/20 VUs, 20210 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  2m39.0s/5m0s

running (2m40.0s), 20/20 VUs, 20332 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  2m40.0s/5m0s

running (2m41.0s), 20/20 VUs, 20458 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  2m41.0s/5m0s

running (2m42.0s), 20/20 VUs, 20577 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  2m42.0s/5m0s

running (2m43.0s), 20/20 VUs, 20682 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  2m43.0s/5m0s

running (2m44.0s), 20/20 VUs, 20818 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  2m44.0s/5m0s

running (2m45.0s), 20/20 VUs, 20952 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  2m45.0s/5m0s

running (2m46.0s), 20/20 VUs, 21051 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  2m46.0s/5m0s

running (2m47.0s), 20/20 VUs, 21163 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  2m47.0s/5m0s

running (2m48.0s), 20/20 VUs, 21282 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  2m48.0s/5m0s

running (2m49.0s), 20/20 VUs, 21384 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  2m49.0s/5m0s

running (2m50.0s), 20/20 VUs, 21432 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  2m50.0s/5m0s

running (2m51.0s), 20/20 VUs, 21487 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  2m51.0s/5m0s

running (2m52.0s), 20/20 VUs, 21562 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  2m52.0s/5m0s

running (2m53.0s), 20/20 VUs, 21645 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  2m53.0s/5m0s

running (2m54.0s), 20/20 VUs, 21719 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  2m54.0s/5m0s

running (2m55.0s), 20/20 VUs, 21784 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  2m55.0s/5m0s

running (2m56.0s), 20/20 VUs, 21836 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  2m56.0s/5m0s

running (2m57.0s), 20/20 VUs, 21972 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  2m57.0s/5m0s

running (2m58.0s), 20/20 VUs, 22107 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  2m58.0s/5m0s

running (2m59.0s), 20/20 VUs, 22231 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  2m59.0s/5m0s

running (3m00.0s), 20/20 VUs, 22326 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  3m00.0s/5m0s

running (3m01.0s), 20/20 VUs, 22404 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  3m01.0s/5m0s

running (3m02.0s), 20/20 VUs, 22488 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  3m02.0s/5m0s

running (3m03.0s), 20/20 VUs, 22562 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  3m03.0s/5m0s

running (3m04.0s), 20/20 VUs, 22652 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  3m04.0s/5m0s

running (3m05.0s), 20/20 VUs, 22721 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  3m05.0s/5m0s

running (3m06.0s), 20/20 VUs, 22786 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  3m06.0s/5m0s

running (3m07.0s), 20/20 VUs, 22911 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  3m07.0s/5m0s

running (3m08.0s), 20/20 VUs, 23025 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  3m08.0s/5m0s

running (3m09.0s), 20/20 VUs, 23107 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  3m09.0s/5m0s

running (3m10.0s), 20/20 VUs, 23194 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  3m10.0s/5m0s

running (3m11.0s), 20/20 VUs, 23273 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  3m11.0s/5m0s

running (3m12.0s), 20/20 VUs, 23395 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  3m12.0s/5m0s

running (3m13.0s), 20/20 VUs, 23480 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  3m13.0s/5m0s

running (3m14.0s), 20/20 VUs, 23552 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  3m14.0s/5m0s

running (3m15.0s), 20/20 VUs, 23613 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  3m15.0s/5m0s

running (3m16.0s), 20/20 VUs, 23632 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  3m16.0s/5m0s

running (3m17.0s), 20/20 VUs, 23678 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  3m17.0s/5m0s

running (3m18.0s), 20/20 VUs, 23813 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  3m18.0s/5m0s

running (3m19.0s), 20/20 VUs, 23914 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  3m19.0s/5m0s

running (3m20.0s), 20/20 VUs, 24001 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  3m20.0s/5m0s

running (3m21.0s), 20/20 VUs, 24074 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  3m21.0s/5m0s

running (3m22.0s), 20/20 VUs, 24187 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  3m22.0s/5m0s

running (3m23.0s), 20/20 VUs, 24314 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  3m23.0s/5m0s

running (3m24.0s), 20/20 VUs, 24373 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  3m24.0s/5m0s

running (3m25.0s), 20/20 VUs, 24404 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  3m25.0s/5m0s

running (3m26.0s), 20/20 VUs, 24444 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  3m26.0s/5m0s

running (3m27.0s), 20/20 VUs, 24498 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  3m27.0s/5m0s

running (3m28.0s), 20/20 VUs, 24581 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  3m28.0s/5m0s

running (3m29.0s), 20/20 VUs, 24645 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  3m29.0s/5m0s

running (3m30.0s), 20/20 VUs, 24771 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  3m30.0s/5m0s

running (3m31.0s), 20/20 VUs, 24847 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  3m31.0s/5m0s

running (3m32.0s), 20/20 VUs, 24930 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  3m32.0s/5m0s

running (3m33.0s), 20/20 VUs, 24969 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  3m33.0s/5m0s

running (3m34.0s), 20/20 VUs, 25028 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  3m34.0s/5m0s

running (3m35.0s), 20/20 VUs, 25085 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  3m35.0s/5m0s

running (3m36.0s), 20/20 VUs, 25148 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  3m36.0s/5m0s

running (3m37.0s), 20/20 VUs, 25220 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  3m37.0s/5m0s

running (3m38.0s), 20/20 VUs, 25262 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  3m38.0s/5m0s

running (3m39.0s), 20/20 VUs, 25326 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  3m39.0s/5m0s

running (3m40.0s), 20/20 VUs, 25409 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  3m40.0s/5m0s

running (3m41.0s), 20/20 VUs, 25476 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  3m41.0s/5m0s

running (3m42.0s), 20/20 VUs, 25556 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  3m42.0s/5m0s

running (3m43.0s), 20/20 VUs, 25609 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  3m43.0s/5m0s

running (3m44.0s), 20/20 VUs, 25702 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  3m44.0s/5m0s

running (3m45.0s), 20/20 VUs, 25812 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  3m45.0s/5m0s

running (3m46.0s), 20/20 VUs, 25894 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  3m46.0s/5m0s

running (3m47.0s), 20/20 VUs, 26004 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  3m47.0s/5m0s

running (3m48.0s), 20/20 VUs, 26112 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  3m48.0s/5m0s

running (3m49.0s), 20/20 VUs, 26233 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  3m49.0s/5m0s

running (3m50.0s), 20/20 VUs, 26279 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  3m50.0s/5m0s

running (3m51.0s), 20/20 VUs, 26359 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  3m51.0s/5m0s

running (3m52.0s), 20/20 VUs, 26439 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  3m52.0s/5m0s

running (3m53.0s), 20/20 VUs, 26515 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  3m53.0s/5m0s

running (3m54.0s), 20/20 VUs, 26576 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  3m54.0s/5m0s

running (3m55.0s), 20/20 VUs, 26631 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  3m55.0s/5m0s

running (3m56.0s), 20/20 VUs, 26675 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  3m56.0s/5m0s

running (3m57.0s), 20/20 VUs, 26753 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  3m57.0s/5m0s

running (3m58.0s), 20/20 VUs, 26828 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  3m58.0s/5m0s

running (3m59.0s), 20/20 VUs, 26889 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  3m59.0s/5m0s

running (4m00.0s), 20/20 VUs, 26941 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  4m00.0s/5m0s

running (4m01.0s), 20/20 VUs, 27026 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  4m01.0s/5m0s

running (4m02.0s), 20/20 VUs, 27088 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  4m02.0s/5m0s

running (4m03.0s), 20/20 VUs, 27176 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  4m03.0s/5m0s

running (4m04.0s), 20/20 VUs, 27255 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  4m04.0s/5m0s

running (4m05.0s), 20/20 VUs, 27322 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  4m05.0s/5m0s

running (4m06.0s), 20/20 VUs, 27406 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  4m06.0s/5m0s

running (4m07.0s), 20/20 VUs, 27492 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  4m07.0s/5m0s

running (4m08.0s), 20/20 VUs, 27633 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  4m08.0s/5m0s

running (4m09.0s), 20/20 VUs, 27706 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  4m09.0s/5m0s

running (4m10.0s), 20/20 VUs, 27780 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  4m10.0s/5m0s

running (4m11.0s), 20/20 VUs, 27823 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  4m11.0s/5m0s

running (4m12.0s), 20/20 VUs, 27930 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  4m12.0s/5m0s

running (4m13.0s), 20/20 VUs, 27984 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  4m13.0s/5m0s

running (4m14.0s), 20/20 VUs, 28056 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  4m14.0s/5m0s

running (4m15.0s), 20/20 VUs, 28112 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  4m15.0s/5m0s

running (4m16.0s), 20/20 VUs, 28166 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  4m16.0s/5m0s

running (4m17.0s), 20/20 VUs, 28245 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  4m17.0s/5m0s

running (4m18.0s), 20/20 VUs, 28370 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  4m18.0s/5m0s

running (4m19.0s), 20/20 VUs, 28489 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  4m19.0s/5m0s

running (4m20.0s), 20/20 VUs, 28555 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  4m20.0s/5m0s

running (4m21.0s), 20/20 VUs, 28613 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  4m21.0s/5m0s

running (4m22.0s), 20/20 VUs, 28715 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  4m22.0s/5m0s

running (4m23.0s), 20/20 VUs, 28817 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  4m23.0s/5m0s

running (4m24.0s), 20/20 VUs, 28876 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  4m24.0s/5m0s

running (4m25.0s), 20/20 VUs, 28943 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  4m25.0s/5m0s

running (4m26.0s), 20/20 VUs, 28973 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  4m26.0s/5m0s

running (4m27.0s), 20/20 VUs, 29030 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  4m27.0s/5m0s

running (4m28.0s), 20/20 VUs, 29147 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  4m28.0s/5m0s

running (4m29.0s), 20/20 VUs, 29240 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  4m29.0s/5m0s

running (4m30.0s), 20/20 VUs, 29368 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  4m30.0s/5m0s

running (4m31.0s), 20/20 VUs, 29462 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  4m31.0s/5m0s

running (4m32.0s), 20/20 VUs, 29560 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  4m32.0s/5m0s

running (4m33.0s), 20/20 VUs, 29654 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  4m33.0s/5m0s

running (4m34.0s), 20/20 VUs, 29718 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  4m34.0s/5m0s

running (4m35.0s), 20/20 VUs, 29789 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  4m35.0s/5m0s

running (4m36.0s), 20/20 VUs, 29839 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  4m36.0s/5m0s

running (4m37.0s), 20/20 VUs, 29891 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  4m37.0s/5m0s

running (4m38.0s), 20/20 VUs, 29958 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  4m38.0s/5m0s

running (4m39.0s), 20/20 VUs, 30003 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  4m39.0s/5m0s

running (4m40.0s), 20/20 VUs, 30076 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  4m40.0s/5m0s

running (4m41.0s), 20/20 VUs, 30121 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  4m41.0s/5m0s

running (4m42.0s), 20/20 VUs, 30214 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  4m42.0s/5m0s

running (4m43.0s), 20/20 VUs, 30307 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  4m43.0s/5m0s

running (4m44.0s), 20/20 VUs, 30390 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  4m44.0s/5m0s

running (4m45.0s), 20/20 VUs, 30491 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  4m45.0s/5m0s

running (4m46.0s), 20/20 VUs, 30579 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  4m46.0s/5m0s

running (4m47.0s), 20/20 VUs, 30700 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  4m47.0s/5m0s

running (4m48.0s), 20/20 VUs, 30820 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  4m48.0s/5m0s

running (4m49.0s), 20/20 VUs, 30914 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  4m49.0s/5m0s

running (4m50.0s), 20/20 VUs, 30991 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  4m50.0s/5m0s

running (4m51.0s), 20/20 VUs, 31025 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  4m51.0s/5m0s

running (4m52.0s), 20/20 VUs, 31094 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  4m52.0s/5m0s

running (4m53.0s), 20/20 VUs, 31147 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  4m53.0s/5m0s

running (4m54.0s), 20/20 VUs, 31194 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  4m54.0s/5m0s

running (4m55.0s), 20/20 VUs, 31243 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  4m55.0s/5m0s

running (4m56.0s), 20/20 VUs, 31277 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  4m56.0s/5m0s

running (4m57.0s), 20/20 VUs, 31317 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  4m57.0s/5m0s

running (4m58.0s), 20/20 VUs, 31343 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  4m58.0s/5m0s

running (4m59.0s), 20/20 VUs, 31409 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  4m59.0s/5m0s

running (5m00.0s), 20/20 VUs, 31480 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  5m00.0s/5m0s

     ✓ failure: response received
     ✓ failure: generated 5xx

     checks.....................: 100.00% ✓ 63000      ✗ 0   
     data_received..............: 7.3 MB  24 kB/s
     data_sent..................: 4.0 MB  13 kB/s
     http_req_blocked...........: avg=56.76µs  min=1.96µs   med=7.77µs   max=65.42ms p(90)=10.5µs   p(95)=21.09µs 
     http_req_connecting........: avg=1.92µs   min=0s       med=0s       max=6.31ms  p(90)=0s       p(95)=0s      
     http_req_duration..........: avg=88.73ms  min=781.11µs med=41.76ms  max=1.91s   p(90)=231.44ms p(95)=335.68ms
     http_req_failed............: 100.00% ✓ 31500      ✗ 0   
     http_req_receiving.........: avg=324.51µs min=14.18µs  med=128.01µs max=13.64ms p(90)=771.21µs p(95)=1.22ms  
     http_req_sending...........: avg=117.45µs min=8.51µs   med=31.1µs   max=32.96ms p(90)=164.65µs p(95)=396.09µs
     http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...........: avg=88.29ms  min=662.07µs med=41.3ms   max=1.91s   p(90)=230.92ms p(95)=334.64ms
     http_reqs..................: 31500   104.923437/s
     iteration_duration.........: avg=190.45ms min=101.31ms med=143.42ms max=2.01s   p(90)=333.33ms p(95)=437.74ms
     iterations.................: 31500   104.923437/s
     vus........................: 20      min=20       max=20
     vus_max....................: 20      min=20       max=20


running (5m00.2s), 00/20 VUs, 31500 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  5m0s